//-------------------------------------------------------------------------------------------------------
// 2026년 1학기 STL 월56 화78		4월 6일														(5주 2일)
//------------------------------------------------------------------------------------------------------- 
// 호출가능 타입
//-------------------------------------------------------------------------------------------------------
#include <iostream>
#include <array>
#include <algorithm>
#include "save.h"

bool 정렬기준(int a, int b)
{
    std::cout << "함수 ";     // 10 * log10 (3 ~ 4정도) 번 호출.
    return a < b;
}

// ----------
int main()
// ----------
{
    std::array<int, 10> a{ 8, 4, 2, 0, 1, 9, 7, 5, 6, 3 };

    sort(a.begin(), a.end(), 정렬기준);       // 3번째 인자에 int 기준 오름차순 이 기본으로 깔림.

    for (int num : a)
        std::cout << num << ' ';
    std::cout << std::endl;

    save("메인.cpp");
}
