//-------------------------------------------------------------------------------------------------------
// 2026년 1학기 STL 월56 화78		3월 24일																					(4주 1일)
//------------------------------------------------------------------------------------------------------- 
// Dynamic memory allocation (동적 메모리 할당)
//-------------------------------------------------------------------------------------------------------
#include <iostream>
#include "save.h"

// [문제] 사용자가 입력한 수만큼 int를 저장할 메모리를 확보하라.
// 1부터 시작하는 정수로 메모리를 채워라.
// 합계를 화면에 출력하라.

// ----------
int main()
// ----------
{
    int count;
    std::cout << "숫자 몇까지 저장할 건지 입력하세요 : ";
    std::cin >> count;
    int* arr = new int[count];

    for (int i = 0; i < count; ++i) {
        arr[i] = i + 1;
    }

    int sum = 0;
    for (int i = 0; i < count; ++i) {
        sum += arr[i];
    }
    std::cout << sum;

    delete[]arr;
    return 0;

	// save("메인.cpp");
}