//-------------------------------------------------------------------------------------------------------
// 2026년 1학기 STL 월56 화78		4월 14일													(7주 1일)
// 중간고사 4월 21일 (8주 1일)
//------------------------------------------------------------------------------------------------------- 
// STL 컨테이너 - Containers are objects that store ohter objects.
//-------------------------------------------------------------------------------------------------------
#include <iostream>
#include <array>
#include <list>
#include "save.h"
#include "ZString.h"

extern bool 관찰;				// 관찰하려면 true

// ----------
int main()
// ----------
{
	std::array<ZString, 5> a{ "1", "333", "22", "4444", "55555"};
	
	// 아쉽지만 다음 시간에
	// iterator로 a를 순회
	// element access - at, operator[], front, back, data

	// save("메인.cpp");
}