//-------------------------------------------------------------------------------------------------------
// 2026년 1학기 STL 월56 화78		3월 31일																					(5주 1일)
//------------------------------------------------------------------------------------------------------- 
// 호출가능 타입 - callable types
// 1. 함수
//      - 함수포인터도 호출가능하다
// 2. lambda
// 3. () 연산자를 구현한 클래스 - 객체를 functor(함수객체)라 함
// 4. 멤버함수와 멤버함수 포인터
// 
// ---> function 클래스로 일관된 사용가능
//-------------------------------------------------------------------------------------------------------
#include <iostream>
#include "save.h"
class Sakura {
public:
    void operator()() {
        std::cout << "안녕 난 람다야 반가워" << std::endl;
    };
};

// ----------
int main()
// ----------
{

    Sakura a;
    a();

    std::cout << typeid(a).name() << std::endl;

    save("메인.cpp");
}